DataProcessors/ИнтеграцияССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияССайтом</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиДоступаКСайту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьПараметрыДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ИнтеграцияССайтом/Ext/ObjectModule.bsl
// Восстанавливает настройки пользователя.
//
Процедура ИнициализацияРеквизитов() Экспорт
	
	СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("Обработка.ИнтеграцияССайтом");
	
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		СтруктураНастроек.Свойство("НастройкаДоступа",          НастройкаДоступа);
		СтруктураНастроек.Свойство("ОбновлятьПараметрыДоступа", ОбновлятьПараметрыДоступа);
	КонецЕсли;
	
КонецПроцедуры // ИнициализацияРеквизитов()
